#include <iostream>
#include <cmath> // Математична бібліотека
#include <cstdlib> //Бібліотека для перетворення типів змінних

using namespace std;

int main(){
    char number[12];
    float V[8];

    for (int i = 0; i < 8; i++){ //Введення значень в масив за допомгою цикла
        cout << "Введіть число: ";
        cin >> number;
        V[i] = atoi(number);
    }
    cout << "Введенні данні: [";
    for (int i = 0; i < 8; i++){ //Виводимо введенні данні за допомогою цикла
        cout << V[i] << ", ";
    }
    cout << "]\n";
    
    cout << "Середнє арифметичне діапазону [-1; 3]: [";
    for (int i = 0; i < 8; i++){ //Визначаємо та виводимо середнє арифметичне за допомогою цикла
        if (V[i] >= -1 && V[i] <= 3){ //Якщо діапазон [-1; 3]
            cout << V[i] << ", ";
        }
    }
    cout << "]\n";
    return 0;
}